'''
Программа считывает input.txt следующего формата: в
первой строке находится целое число L (от 1 до 100) – количество слов в списке.
В следующих L строках – список слов, по одному слову в каждой строке. (слово < 20)
В следующей строке – зашифрованное сообщение из не более чем 200 символов.
Список слов не обязательно содержит все слова из сообщения и наоборот. 
Вывести output.txt: расшифрованное сообщение, содержащее максимальное количество слов 
из входного списка (с учетом их повторений в зашифрованном сообщении). 
Если решений несколько, то вывести одно из них. Зашифрованное и расшифрованное сообщения состоят
только из заглавных латинских букв и пробелов. 
'''