# Дана последовательность слов, посчитать вхождение каждого, найти самое частое 
w = list(map(str,input("Введите слова: ").split()))
print(str(w))








# 2 Задаётся список стран с её городами. По заданному городу определить к какой стране относится 
# 3 Задаются пары страна - столица. Вывести список пар отсортированный по странам и список в алфавитном порядке по сталицам.



